//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//用户宏定义
//-------------------------------------------------------------------------------------------------
#ifndef  snail_macro_defed
#define  snail_macro_defed
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#ifndef snail_data_types
    #include ".\snail_data_types.h"
#endif
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//数组清零
//-------------------------------------------------------------------------------------------------
#define macro_clear_array(in_arrayName) \
do\
{\
    sdt_int8u in_arrayName##_index = 0;\
    sdt_int8u in_arrayName##_size = sizeof(in_arrayName);\
    while(in_arrayName##_size)\
    {\
        in_arrayName##[in_arrayName##_index] = 0;\
        in_arrayName##_index++;\
        in_arrayName##_size--;\
    }\
}while(0)
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//数组填充
//-------------------------------------------------------------------------------------------------
#define macro_fill_array(in_arrayName,in_newData) \
do\
{\
    sdt_int8u in_arrayName##_index = 0;\
    sdt_int8u in_arrayName##_size = sizeof(in_arrayName);\
    while(in_arrayName##_size)\
    {\
        in_arrayName##[in_arrayName##_index] = in_newData;\
        in_arrayName##_index++;\
        in_arrayName##_size--;\
    }\
}while(0)
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//+++++++++++++++++++++++++++++++++++++++++++end+++++++++++++++++++++++++++++++++++++++++++++++++++
//指针边界保护
//BN_TRUE 正常
//---------------------------------------------------------------------
//#define _CheckPointerBoundary(_CurrentIndex,_MaxIndex,_NotFail) \
//do\
//{\
//   if((_CurrentIndex)>(_MaxIndex))\
//   {\
//       _NotFail=BN_FALSE;\
//   }\
//   else\
//   {\
//       _NotFail=BN_TRUE;\
//   }\
//}while(0)

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//获取数组最大索引
//---------------------------------------------------------------------
#define macro_getArrayMaxIndex(in_arrayName) (sizeof(in_arrayName)-1)
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#endif	
//++++++++++++++++++++++++++++++++End++++++++++++++++++++++++++++++++++

